# IsEqual Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..IsEqual Method
FillGrid Class See Also
---
Check if two fill grids are equal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEqual(
	FillGrid other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As FillGrid _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	FillGrid^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..FillGrid The fill grid to be compared.
# ### Return Value
True if the two fill grids are equal, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillGrid Class
Autodesk.Revit.DB Namespace